app/controllers/books_controller.rb

  def index
    @books = Book.where(user_id: current_user.id)
---
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 1

  def create
    @book = Book.new(book_params)
    respond_to do |format|
      @book.user_id = current_user.id
      if @book.save
---
INSERT INTO `books` (`title`, `author_id`, `published_at`, `uuid`, `publisher_name`, `created_at`, `updated_at`, `users_id`) VALUES ('rwgferwgwe', 8, '2020-11-09 00:12:00', '34554', 'dgsd', '2020-11-09 00:12:42', '2020-11-09 00:12:42', 1)

  def update
      respond_to do |format|
          if @book.update(book_params)
---
UPDATE `books` SET `uuid` = '1234', `updated_at` = '2020-11-08 22:39:02' WHERE `books`.`id` = 7

  def destroy
      @book.destroy
---
DELETE FROM `books` WHERE `books`.`id` = 6

  def set_book
    @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 7 LIMIT 1