app/controllers/csv_files_controller.rb

SELECT `csv_files`.* FROM `csv_files` WHERE `csv_files`.`user_id` = 1
---
  def index
    @csv_files = CsvFile.where(user_id: current_user.id)

INSERT INTO `csv_files` (`file`, `created_at`, `updated_at`, `user_id`) VALUES ('file-214f3e90-05db-0139-b840-48f750367834.csv', '2020-11-10 23:33:58', '2020-11-10 23:33:58', 1)
---
  def create
    @csv_file = CsvFile.new(cvs_params)
    puts cvs_params.inspect.to_yaml
    respond_to do |format|
      @csv_file.user_id = current_user.id
      if @csv_file.save

DELETE FROM `csv_files` WHERE `csv_files`.`id` = 1
---
  def destroy
    @csv_file.destroy

SELECT  `csv_files`.* FROM `csv_files` WHERE `csv_files`.`id` = 30 LIMIT 1
---
  def set_csv_file
    @csv_file = CsvFile.find(params[:id])